
## Plan Result (management)

[CI link](https://github.com/tqer39/private-lab/actions/runs/2266780744)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.terraform-backend.module.s3-bucket.aws_s3_bucket_acl.this
  * module.terraform-backend.module.s3-bucket.aws_s3_bucket_versioning.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.terraform-backend.module.s3-bucket.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = "terraform-tfstate-tqer39-577523824419-ap-northeast-1"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.terraform-backend.module.s3-bucket.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = "terraform-tfstate-tqer39-577523824419-ap-northeast-1"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":10,"Program":"tfcmt","SHA1":"24ec3ee4ec6c8051b0c56cdfb6a136fa541e0508","Target":"management","Vars":{},"WorkflowName":"Terraform - AWS - Management"} -->